RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW22D5/include/MKW22D5_extension.h
/*******************************************************************************
 * RTC_LR - RTC Lock Register
 ******************************************************************************/

/*!
 * @brief RTC_LR - RTC Lock Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
/*!
 * @name Constants and macros for entire RTC_LR register
 */
/*@{*/
#define RTC_RD_LR(base)          (RTC_LR_REG(base))
#define RTC_WR_LR(base, value)   (RTC_LR_REG(base) = (value))
#define RTC_RMW_LR(base, mask, value) (RTC_WR_LR(base, (RTC_RD_LR(base) & ~(mask)) | (value)))
#define RTC_SET_LR(base, value)  (RTC_WR_LR(base, RTC_RD_LR(base) |  (value)))
#define RTC_CLR_LR(base, value)  (RTC_WR_LR(base, RTC_RD_LR(base) & ~(value)))
#define RTC_TOG_LR(base, value)  (RTC_WR_LR(base, RTC_RD_LR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual RTC_LR bitfields
 */

/*!
 * @name Register RTC_LR, field TCL[3] (RW)
 *
 * After being cleared, this bit can be set only by POR or software reset.
 *
 * Values:
 * - 0b0 - Time Compensation Register is locked and writes are ignored.
 * - 0b1 - Time Compensation Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_TCL field. */
#define RTC_RD_LR_TCL(base)  ((RTC_LR_REG(base) & RTC_LR_TCL_MASK) >> RTC_LR_TCL_SHIFT)
#define RTC_BRD_LR_TCL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_TCL_SHIFT))

/*! @brief Set the TCL field to a new value. */
#define RTC_WR_LR_TCL(base, value) (RTC_RMW_LR(base, RTC_LR_TCL_MASK, RTC_LR_TCL(value)))
#define RTC_BWR_LR_TCL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_TCL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field CRL[4] (RW)
 *
 * After being cleared, this bit can only be set by POR.
 *
 * Values:
 * - 0b0 - Control Register is locked and writes are ignored.
 * - 0b1 - Control Register is not locked and writes complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_CRL field. */
#define RTC_RD_LR_CRL(base)  ((RTC_LR_REG(base) & RTC_LR_CRL_MASK) >> RTC_LR_CRL_SHIFT)
#define RTC_BRD_LR_CRL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_CRL_SHIFT))

/*! @brief Set the CRL field to a new value. */
#define RTC_WR_LR_CRL(base, value) (RTC_RMW_LR(base, RTC_LR_CRL_MASK, RTC_LR_CRL(value)))
#define RTC_BWR_LR_CRL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_CRL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field SRL[5] (RW)
 *
 * After being cleared, this bit can be set only by POR or software reset.
 *
 * Values:
 * - 0b0 - Status Register is locked and writes are ignored.
 * - 0b1 - Status Register is not locked and writes complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_SRL field. */
#define RTC_RD_LR_SRL(base)  ((RTC_LR_REG(base) & RTC_LR_SRL_MASK) >> RTC_LR_SRL_SHIFT)
#define RTC_BRD_LR_SRL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_SRL_SHIFT))

/*! @brief Set the SRL field to a new value. */
#define RTC_WR_LR_SRL(base, value) (RTC_RMW_LR(base, RTC_LR_SRL_MASK, RTC_LR_SRL(value)))
#define RTC_BWR_LR_SRL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_SRL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field LRL[6] (RW)
 *
 * After being cleared, this bit can be set only by POR or software reset.
 *
 * Values:
 * - 0b0 - Lock Register is locked and writes are ignored.
 * - 0b1 - Lock Register is not locked and writes complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_LRL field. */
#define RTC_RD_LR_LRL(base)  ((RTC_LR_REG(base) & RTC_LR_LRL_MASK) >> RTC_LR_LRL_SHIFT)
#define RTC_BRD_LR_LRL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_LRL_SHIFT))

/*! @brief Set the LRL field to a new value. */
#define RTC_WR_LR_LRL(base, value) (RTC_RMW_LR(base, RTC_LR_LRL_MASK, RTC_LR_LRL(value)))
#define RTC_BWR_LR_LRL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_LRL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field TTSL[8] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Tamper Time Seconds Register is locked and writes are ignored.
 * - 0b1 - Tamper Time Seconds Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_TTSL field. */
#define RTC_RD_LR_TTSL(base) ((RTC_LR_REG(base) & RTC_LR_TTSL_MASK) >> RTC_LR_TTSL_SHIFT)
#define RTC_BRD_LR_TTSL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_TTSL_SHIFT))

/*! @brief Set the TTSL field to a new value. */
#define RTC_WR_LR_TTSL(base, value) (RTC_RMW_LR(base, RTC_LR_TTSL_MASK, RTC_LR_TTSL(value)))
#define RTC_BWR_LR_TTSL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_TTSL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field MEL[9] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Monotonic Enable Register is locked and writes are ignored.
 * - 0b1 - Monotonic Enable Register is not locked and writes complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_MEL field. */
#define RTC_RD_LR_MEL(base)  ((RTC_LR_REG(base) & RTC_LR_MEL_MASK) >> RTC_LR_MEL_SHIFT)
#define RTC_BRD_LR_MEL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MEL_SHIFT))

/*! @brief Set the MEL field to a new value. */
#define RTC_WR_LR_MEL(base, value) (RTC_RMW_LR(base, RTC_LR_MEL_MASK, RTC_LR_MEL(value)))
#define RTC_BWR_LR_MEL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field MCLL[10] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Monotonic Counter Low Register is locked and writes are ignored.
 * - 0b1 - Monotonic Counter Low Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_MCLL field. */
#define RTC_RD_LR_MCLL(base) ((RTC_LR_REG(base) & RTC_LR_MCLL_MASK) >> RTC_LR_MCLL_SHIFT)
#define RTC_BRD_LR_MCLL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MCLL_SHIFT))

/*! @brief Set the MCLL field to a new value. */
#define RTC_WR_LR_MCLL(base, value) (RTC_RMW_LR(base, RTC_LR_MCLL_MASK, RTC_LR_MCLL(value)))
#define RTC_BWR_LR_MCLL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MCLL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_LR, field MCHL[11] (RW)
 *
 * After being cleared, this bit can be set only by VBAT POR or software reset.
 *
 * Values:
 * - 0b0 - Monotonic Counter High Register is locked and writes are ignored.
 * - 0b1 - Monotonic Counter High Register is not locked and writes complete as
 *     normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_LR_MCHL field. */
#define RTC_RD_LR_MCHL(base) ((RTC_LR_REG(base) & RTC_LR_MCHL_MASK) >> RTC_LR_MCHL_SHIFT)
#define RTC_BRD_LR_MCHL(base) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MCHL_SHIFT))

/*! @brief Set the MCHL field to a new value. */
#define RTC_WR_LR_MCHL(base, value) (RTC_RMW_LR(base, RTC_LR_MCHL_MASK, RTC_LR_MCHL(value)))
#define RTC_BWR_LR_MCHL(base, value) (BITBAND_ACCESS32(&RTC_LR_REG(base), RTC_LR_MCHL_SHIFT) = (value))
/*@}*/

